#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

data.discord_color.marshmallow_pink: Reading...
discord_server.server: Refreshing state... [id=983673922803347516]
data.discord_color.marshmallow_pink: Read complete after 0s [id=16731765]
data.discord_permission.basic_user: Reading...
data.discord_permission.basic_user: Read complete after 0s [id=4198072037]
data.discord_color.terraform_purple: Reading...
data.discord_color.terraform_purple: Read complete after 0s [id=8405193]
module.add_Thelma.data.discord_member.user_by_username: Reading...
module.add_xenofon.data.discord_member.user_by_username: Reading...
discord_category_channel.general: Refreshing state... [id=984530248379031562]
module.add_jodu.data.discord_member.user_by_username: Reading...
discord_role.basic_user_role: Refreshing state... [id=984491811378704458]
module.add_rudi.data.discord_member.user_by_username: Reading...
discord_role.moderator: Refreshing state... [id=984491775991369728]
module.add_danny.data.discord_member.user_by_username: Reading...
module.add_jodu.data.discord_member.user_by_username: Read complete after 1s [id=984528458526904381]
module.add_Thelma.data.discord_member.user_by_username: Read complete after 1s [id=733740361620652062]
module.add_jodu.discord_member_roles.basic_user: Refreshing state... [id=2613935418]
module.add_Thelma.discord_member_roles.basic_user: Refreshing state... [id=2465703737]
discord_text_channel.welcome: Refreshing state... [id=984530249121415208]
module.add_rudi.data.discord_member.user_by_username: Read complete after 1s [id=334405573523144706]
module.add_rudi.discord_member_roles.basic_user: Refreshing state... [id=34431408]
module.add_xenofon.data.discord_member.user_by_username: Read complete after 1s [id=691726339417440338]
module.add_xenofon.discord_member_roles.basic_user: Refreshing state... [id=3524616678]
module.add_rudi.discord_message.welcome_message: Refreshing state... [id=984536026787741726]
module.add_jodu.discord_message.welcome_message: Refreshing state... [id=984533995209523252]
module.add_xenofon.discord_message.welcome_message: Refreshing state... [id=984535400720777236]
module.add_Thelma.discord_message.welcome_message: Refreshing state... [id=984537061895848057]
module.add_danny.data.discord_member.user_by_username: Read complete after 1s [id=489328413983899661]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # discord_text_channel.bed_time will be created
  + resource "discord_text_channel" "bed_time" {
      + category                 = "984530248379031562"
      + id                       = (known after apply)
      + name                     = "late-night-vibes"
      + nsfw                     = false
      + position                 = 1
      + server_id                = "983673922803347516"
      + sync_perms_with_category = true
      + type                     = "text"
    }

  # module.add_danny.discord_member_roles.basic_user will be created
  + resource "discord_member_roles" "basic_user" {
      + id        = (known after apply)
      + server_id = "983673922803347516"
      + user_id   = "489328413983899661"

      + role {
          + has_role = true
          + role_id  = "984491811378704458"
        }
    }

  # module.add_danny.discord_message.welcome_message will be created
  + resource "discord_message" "welcome_message" {
      + author           = (known after apply)
      + channel_id       = "984530249121415208"
      + edited_timestamp = (known after apply)
      + id               = (known after apply)
      + pinned           = false
      + server_id        = (known after apply)
      + timestamp        = (known after apply)
      + tts              = false
      + type             = (known after apply)

      + embed {
          + title = "Welcome to the club Daniel!"

          + fields {
              + inline = false
              + name   = "Username:"
              + value  = "Executioner"
            }

          + footer {
              + text = "Say hello and have a look around!"
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Thelmaandherls, Action: `pull_request`*